pellepl/baremetal/arch/msp/msp430/mdk/include/rf430frl154h.h
sfr_w(CRCDI);                                 /* CRC Data In Register */
sfr_b(CRCDI_L);                               /* CRC Data In Register */
sfr_b(CRCDI_H);                               /* CRC Data In Register */
sfr_w(CRCDIRB);                               /* CRC data in reverse byte Register */
sfr_b(CRCDIRB_L);                             /* CRC data in reverse byte Register */
sfr_b(CRCDIRB_H);                             /* CRC data in reverse byte Register */
sfr_w(CRCINIRES);                             /* CRC Initialisation Register and Result Register */
sfr_b(CRCINIRES_L);                           /* CRC Initialisation Register and Result Register */
sfr_b(CRCINIRES_H);                           /* CRC Initialisation Register and Result Register */
sfr_w(CRCRESR);                               /* CRC reverse result Register */
sfr_b(CRCRESR_L);                             /* CRC reverse result Register */
sfr_b(CRCRESR_H);                             /* CRC reverse result Register */

/************************************************************
* DIGITAL I/O Port1/2 Pull up / Pull down Resistors
************************************************************/
#define __MSP430_HAS_PORT1_R__                /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_PORT1_R__ 0x0200
#define P1_BASE                __MSP430_BASEADDRESS_PORT1_R__
#define __MSP430_HAS_PORT2_R__                /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_PORT2_R__ 0x0200
#define P2_BASE                __MSP430_BASEADDRESS_PORT2_R__
#define __MSP430_HAS_PORTA_R__                /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_PORTA_R__ 0x0200
#define PA_BASE                __MSP430_BASEADDRESS_PORTA_R__
#define __MSP430_HAS_P1SEL0__                 /* Define for DriverLib */
#define __MSP430_HAS_P2SEL0__                 /* Define for DriverLib */
#define __MSP430_HAS_PASEL0__                 /* Define for DriverLib */
#define __MSP430_HAS_P1SEL1__                 /* Define for DriverLib */
#define __MSP430_HAS_P2SEL1__                 /* Define for DriverLib */
#define __MSP430_HAS_PASEL1__                 /* Define for DriverLib */

sfr_w(PAIN);                                  /* Port A Input */
sfr_b(PAIN_L);                                /* Port A Input */
sfr_b(PAIN_H);                                /* Port A Input */
sfr_w(PAOUT);                                 /* Port A Output */
sfr_b(PAOUT_L);                               /* Port A Output */
sfr_b(PAOUT_H);                               /* Port A Output */
sfr_w(PADIR);                                 /* Port A Direction */
sfr_b(PADIR_L);                               /* Port A Direction */
sfr_b(PADIR_H);                               /* Port A Direction */
sfr_w(PAREN);                                 /* Port A Resistor Enable */
sfr_b(PAREN_L);                               /* Port A Resistor Enable */
sfr_b(PAREN_H);                               /* Port A Resistor Enable */
sfr_w(PADS);                                  /* Port A Drive Strenght */
sfr_b(PADS_L);                                /* Port A Drive Strenght */
sfr_b(PADS_H);                                /* Port A Drive Strenght */
sfr_w(PASEL0);                                /* Port A Selection 0 */
sfr_b(PASEL0_L);                              /* Port A Selection 0 */
sfr_b(PASEL0_H);                              /* Port A Selection 0 */
sfr_w(PASEL1);                                /* Port A Selection 1 */
sfr_b(PASEL1_L);                              /* Port A Selection 1 */
sfr_b(PASEL1_H);                              /* Port A Selection 1 */
sfr_w(PAIES);                                 /* Port A Interrupt Edge Select */
sfr_b(PAIES_L);                               /* Port A Interrupt Edge Select */
sfr_b(PAIES_H);                               /* Port A Interrupt Edge Select */
sfr_w(PAIE);                                  /* Port A Interrupt Enable */
sfr_b(PAIE_L);                                /* Port A Interrupt Enable */
sfr_b(PAIE_H);                                /* Port A Interrupt Enable */
sfr_w(PAIFG);                                 /* Port A Interrupt Flag */
sfr_b(PAIFG_L);                               /* Port A Interrupt Flag */
sfr_b(PAIFG_H);                               /* Port A Interrupt Flag */


sfr_w(P1IV);                                  /* Port 1 Interrupt Vector Word */
sfr_w(P2IV);                                  /* Port 2 Interrupt Vector Word */
#define P1IN                   (PAIN_L)       /* Port 1 Input */
#define P1OUT                  (PAOUT_L)      /* Port 1 Output */
#define P1DIR                  (PADIR_L)      /* Port 1 Direction */
#define P1REN                  (PAREN_L)      /* Port 1 Resistor Enable */
#define P1DS                   (PADS_L)       /* Port 1 Drive Strenght */
#define P1SEL0                 (PASEL0_L)     /* Port 1 Selection 0 */
#define P1SEL1                 (PASEL1_L)     /* Port 1 Selection 1 */
#define P1IES                  (PAIES_L)      /* Port 1 Interrupt Edge Select */
#define P1IE                   (PAIE_L)       /* Port 1 Interrupt Enable */
#define P1IFG                  (PAIFG_L)      /* Port 1 Interrupt Flag */

//Definitions for P1IV
#define P1IV_NONE              (0x0000)       /* No Interrupt pending */
#define P1IV_P1IFG0            (0x0002)       /* P1IV P1IFG.0 */
#define P1IV_P1IFG1            (0x0004)       /* P1IV P1IFG.1 */
#define P1IV_P1IFG2            (0x0006)       /* P1IV P1IFG.2 */
#define P1IV_P1IFG3            (0x0008)       /* P1IV P1IFG.3 */
#define P1IV_P1IFG4            (0x000A)       /* P1IV P1IFG.4 */
#define P1IV_P1IFG5            (0x000C)       /* P1IV P1IFG.5 */
#define P1IV_P1IFG6            (0x000E)       /* P1IV P1IFG.6 */
#define P1IV_P1IFG7            (0x0010)       /* P1IV P1IFG.7 */

#define P2IN                   (PAIN_H)       /* Port 2 Input */
#define P2OUT                  (PAOUT_H)      /* Port 2 Output */
#define P2DIR                  (PADIR_H)      /* Port 2 Direction */
#define P2REN                  (PAREN_H)      /* Port 2 Resistor Enable */
#define P2DS                   (PADS_H)       /* Port 2 Drive Strenght */
#define P2SEL0                 (PASEL0_H)     /* Port 2 Selection 0 */
#define P2SEL1                 (PASEL1_H)     /* Port 2 Selection 1 */
#define P2IES                  (PAIES_H)      /* Port 2 Interrupt Edge Select */
#define P2IE                   (PAIE_H)       /* Port 2 Interrupt Enable */
#define P2IFG                  (PAIFG_H)      /* Port 2 Interrupt Flag */

//Definitions for P2IV
#define P2IV_NONE              (0x0000)       /* No Interrupt pending */
#define P2IV_P2IFG0            (0x0002)       /* P2IV P2IFG.0 */
#define P2IV_P2IFG1            (0x0004)       /* P2IV P2IFG.1 */
#define P2IV_P2IFG2            (0x0006)       /* P2IV P2IFG.2 */
#define P2IV_P2IFG3            (0x0008)       /* P2IV P2IFG.3 */
#define P2IV_P2IFG4            (0x000A)       /* P2IV P2IFG.4 */
#define P2IV_P2IFG5            (0x000C)       /* P2IV P2IFG.5 */
#define P2IV_P2IFG6            (0x000E)       /* P2IV P2IFG.6 */
#define P2IV_P2IFG7            (0x0010)       /* P2IV P2IFG.7 */


/************************************************************
* RF13M (13MHz NFC communication module)
************************************************************/
#define __MSP430_HAS_RF13M__                  /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_RF13M__ 0x0800
#define RF13M_BASE             __MSP430_BASEADDRESS_RF13M__

sfr_w(RF13MCTL);                              /* RF13M Control register */
sfr_b(RF13MCTL_L);                            /* RF13M Control register */
sfr_b(RF13MCTL_H);                            /* RF13M Control register */
sfr_w(RF13MINT);                              /* RF13M Interrupt Enable/Flag register */
sfr_b(RF13MINT_L);                            /* RF13M Interrupt Enable/Flag register */
sfr_b(RF13MINT_H);                            /* RF13M Interrupt Enable/Flag register */
sfr_w(RF13MIV);                               /* RF13M Interrupt Vector register */
sfr_b(RF13MIV_L);                             /* RF13M Interrupt Vector register */
sfr_b(RF13MIV_H);                             /* RF13M Interrupt Vector register */
sfr_w(RF13MRXF);                              /* RF13M Receive Data FIFO register */
sfr_b(RF13MRXF_L);                            /* RF13M Receive Data FIFO register */
sfr_b(RF13MRXF_H);                            /* RF13M Receive Data FIFO register */
sfr_w(RF13MTXF);                              /* RF13M Transmit Data FIFO register */
sfr_b(RF13MTXF_L);                            /* RF13M Transmit Data FIFO register */
sfr_b(RF13MTXF_H);                            /* RF13M Transmit Data FIFO register */
sfr_w(RF13MCRC);                              /* RF13M CRC accumulator register */
sfr_b(RF13MCRC_L);                            /* RF13M CRC accumulator register */
sfr_b(RF13MCRC_H);                            /* RF13M CRC accumulator register */
sfr_w(RF13MFIFOFL);                           /* RF13M Receive/Transmit Data FIFO Fill Level register */
sfr_b(RF13MFIFOFL_L);                         /* RF13M Receive/Transmit Data FIFO Fill Level register */
sfr_b(RF13MFIFOFL_H);                         /* RF13M Receive/Transmit Data FIFO Fill Level register */
sfr_w(RF13MWMCFG);                            /* RF13M Receive High/Transmit Low Watermark configuration register */
sfr_b(RF13MWMCFG_L);                          /* RF13M Receive High/Transmit Low Watermark configuration register */
sfr_b(RF13MWMCFG_H);                          /* RF13M Receive High/Transmit Low Watermark configuration register */
sfr_w(RF13MRXBUF);                            /* RF13M Receive data buffer */
sfr_b(RF13MRXBUF_L);                          /* RF13M Receive data buffer */
sfr_b(RF13MRXBUF_H);                          /* RF13M Receive data buffer */
sfr_w(RF13MTXBUF);                            /* RF13M Transmit data buffer */
sfr_b(RF13MTXBUF_L);                          /* RF13M Transmit data buffer */
sfr_b(RF13MTXBUF_H);                          /* RF13M Transmit data buffer */

/* RF13MCTL Control Bits */
#define RF13MRXEN              (0x0001)       /* RF13M Enable reception of downlink */
#define RF13MTXEN              (0x0002)       /* RF13M Enable transmission of uplink */
#define RF13MRFTOEN            (0x0004)       /* RF13M Enable RF Field timeout detection */
#define RF13MSC                (0x0010)       /* RF13M Manually select uplink subcarrier setting */
#define RF13MDR                (0x0020)       /* RF13M Manually select uplink data rate */
#define RF13MMCFG              (0x0080)       /* RF13M Enable manual configuration of ISO15693 uplink parameters */
#define RF13MCRCOK             (0x0100)       /* RF13M CRC valued correct or not flag */
#define RF13MHFD               (0x0200)       /* RF13M Indicates if a HF field was detected since last readout */
#define RF13MRXIWOC            (0x2000)       /* RF13M Gate RX interrupt with CRC OK */
#define RF13MBE                (0x4000)       /* RF13M Select between big or little endian mode */

/* RF13MCTL Control Bits */
#define RF13MRXEN_L            (0x0001)       /* RF13M Enable reception of downlink */
#define RF13MTXEN_L            (0x0002)       /* RF13M Enable transmission of uplink */
#define RF13MRFTOEN_L          (0x0004)       /* RF13M Enable RF Field timeout detection */
#define RF13MSC_L              (0x0010)       /* RF13M Manually select uplink subcarrier setting */
#define RF13MDR_L              (0x0020)       /* RF13M Manually select uplink data rate */
#define RF13MMCFG_L            (0x0080)       /* RF13M Enable manual configuration of ISO15693 uplink parameters */

/* RF13MCTL Control Bits */
#define RF13MCRCOK_H           (0x0001)       /* RF13M CRC valued correct or not flag */
#define RF13MHFD_H             (0x0002)       /* RF13M Indicates if a HF field was detected since last readout */
#define RF13MRXIWOC_H          (0x0020)       /* RF13M Gate RX interrupt with CRC OK */
#define RF13MBE_H              (0x0040)       /* RF13M Select between big or little endian mode */

