pellepl/baremetal/arch/msp/msp430/mdk/include/rf430frl154h.h
/* SYSJMBC Control Bits */
#define JMBIN0FG               (0x0001)       /* SYS - Incoming JTAG Mailbox 0 Flag */
#define JMBIN1FG               (0x0002)       /* SYS - Incoming JTAG Mailbox 1 Flag */
#define JMBOUT0FG              (0x0004)       /* SYS - Outgoing JTAG Mailbox 0 Flag */
#define JMBOUT1FG              (0x0008)       /* SYS - Outgoing JTAG Mailbox 1 Flag */
#define JMBMODE                (0x0010)       /* SYS - JMB 16/32 Bit Mode */
//#define RESERVED          (0x0020)  /* SYS - Reserved */
#define JMBCLR0OFF             (0x0040)       /* SYS - Incoming JTAG Mailbox 0 Flag auto-clear disalbe */
#define JMBCLR1OFF             (0x0080)       /* SYS - Incoming JTAG Mailbox 1 Flag auto-clear disalbe */
//#define RESERVED          (0x0100)  /* SYS - Reserved */
//#define RESERVED          (0x0200)  /* SYS - Reserved */
//#define RESERVED          (0x0400)  /* SYS - Reserved */
//#define RESERVED          (0x0800)  /* SYS - Reserved */
//#define RESERVED          (0x1000)  /* SYS - Reserved */
//#define RESERVED          (0x2000)  /* SYS - Reserved */
//#define RESERVED          (0x4000)  /* SYS - Reserved */
//#define RESERVED          (0x8000)  /* SYS - Reserved */

/* SYSJMBC Control Bits */
#define JMBIN0FG_L             (0x0001)       /* SYS - Incoming JTAG Mailbox 0 Flag */
#define JMBIN1FG_L             (0x0002)       /* SYS - Incoming JTAG Mailbox 1 Flag */
#define JMBOUT0FG_L            (0x0004)       /* SYS - Outgoing JTAG Mailbox 0 Flag */
#define JMBOUT1FG_L            (0x0008)       /* SYS - Outgoing JTAG Mailbox 1 Flag */
#define JMBMODE_L              (0x0010)       /* SYS - JMB 16/32 Bit Mode */
//#define RESERVED          (0x0020)  /* SYS - Reserved */
#define JMBCLR0OFF_L           (0x0040)       /* SYS - Incoming JTAG Mailbox 0 Flag auto-clear disalbe */
#define JMBCLR1OFF_L           (0x0080)       /* SYS - Incoming JTAG Mailbox 1 Flag auto-clear disalbe */
//#define RESERVED          (0x0100)  /* SYS - Reserved */
//#define RESERVED          (0x0200)  /* SYS - Reserved */
//#define RESERVED          (0x0400)  /* SYS - Reserved */
//#define RESERVED          (0x0800)  /* SYS - Reserved */
//#define RESERVED          (0x1000)  /* SYS - Reserved */
//#define RESERVED          (0x2000)  /* SYS - Reserved */
//#define RESERVED          (0x4000)  /* SYS - Reserved */
//#define RESERVED          (0x8000)  /* SYS - Reserved */

/* SYSCNF Control Bits */
//#define RESERVED          (0x0001)  /* SYS - Reserved */
//#define RESERVED          (0x0002)  /* SYS - Reserved */
//#define RESERVED          (0x0004)  /* SYS - Reserved */
//#define RESERVED          (0x0008)  /* SYS - Reserved */
//#define RESERVED          (0x0010)  /* SYS - Reserved */
//#define RESERVED          (0x0020)  /* SYS - Reserved */
//#define RESERVED          (0x0040)  /* SYS - Reserved */
//#define RESERVED          (0x0080)  /* SYS - Reserved */
#define FRAMLOCK0              (0x0100)       /* SYS - FRAM Write protect area 0 */
#define FRAMLOCK1              (0x0200)       /* SYS - FRAM Write protect area 1 */
#define FRAMLOCK2              (0x0400)       /* SYS - FRAM Write protect area 2 */
#define DEVRAMLOCK             (0x0800)       /* SYS - Write protect Re-Mapped ROM development area */
#define ROMDEVMODE             (0x1000)       /* SYS - Enable ROM Developent mode */
//#define RESERVED          (0x2000)  /* SYS - Reserved */
//#define RESERVED          (0x4000)  /* SYS - Reserved */
//#define RESERVED          (0x8000)  /* SYS - Reserved */

/* SYSCNF Control Bits */
//#define RESERVED          (0x0001)  /* SYS - Reserved */
//#define RESERVED          (0x0002)  /* SYS - Reserved */
//#define RESERVED          (0x0004)  /* SYS - Reserved */
//#define RESERVED          (0x0008)  /* SYS - Reserved */
//#define RESERVED          (0x0010)  /* SYS - Reserved */
//#define RESERVED          (0x0020)  /* SYS - Reserved */
//#define RESERVED          (0x0040)  /* SYS - Reserved */
//#define RESERVED          (0x0080)  /* SYS - Reserved */
#define FRAMLOCK0_H            (0x0001)       /* SYS - FRAM Write protect area 0 */
#define FRAMLOCK1_H            (0x0002)       /* SYS - FRAM Write protect area 1 */
#define FRAMLOCK2_H            (0x0004)       /* SYS - FRAM Write protect area 2 */
#define DEVRAMLOCK_H           (0x0008)       /* SYS - Write protect Re-Mapped ROM development area */
#define ROMDEVMODE_H           (0x0010)       /* SYS - Enable ROM Developent mode */
//#define RESERVED          (0x2000)  /* SYS - Reserved */
//#define RESERVED          (0x4000)  /* SYS - Reserved */
//#define RESERVED          (0x8000)  /* SYS - Reserved */

/************************************************************
* PMM_RF - Power Management System of RF
************************************************************/
#define __MSP430_HAS_PMM_RF__                 /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_PMM_RF__ 0x0120
#define PMM_BASE               __MSP430_BASEADDRESS_PMM_RF__

sfr_w(RFPMMCTL0);                             /* RF PMM Control 0 */
sfr_b(RFPMMCTL0_L);                           /* RF PMM Control 0 */
sfr_b(RFPMMCTL0_H);                           /* RF PMM Control 0 */
sfr_w(RFPMMCTL1);                             /* RF PMM Control 1 */
sfr_b(RFPMMCTL1_L);                           /* RF PMM Control 1 */
sfr_b(RFPMMCTL1_H);                           /* RF PMM Control 1 */
sfr_w(RFMMIE);                                /* RF PPM interrupt enable register */
sfr_b(RFMMIE_L);                              /* RF PPM interrupt enable register */
sfr_b(RFMMIE_H);                              /* RF PPM interrupt enable register */
sfr_w(RFPMMIFG);                              /* RF PMM Interrupt Flag */
sfr_b(RFPMMIFG_L);                            /* RF PMM Interrupt Flag */
sfr_b(RFPMMIFG_H);                            /* RF PMM Interrupt Flag */
sfr_w(RFPMMIV);                               /* RF PMM Interrupt vector regiser */
sfr_b(RFPMMIV_L);                             /* RF PMM Interrupt vector regiser */
sfr_b(RFPMMIV_H);                             /* RF PMM Interrupt vector regiser */

#define RFPMM0                 RFPMMCTL0_L    /* RF PMM mapping register */
#define RFPMM1                 RFPMMCTL0_H    /* RF PMM mapping register */
#define RFPMM2                 RFPMMCTL1_L    /* RF PMM mapping register */
#define RFPMM3                 RFPMMCTL1_H    /* RF PMM mapping register */
#define RFPMM4                 RFMMIE_L       /* RF PMM mapping register */
#define RFPMM5                 RFMMIE_H       /* RF PMM mapping register */
#define RFPMM6                 RFPMMIFG_L     /* RF PMM mapping register */
#define RFPMM7                 RFPMMIFG_H     /* RF PMM mapping register */
#define RFPMM8                 RFPMMIV_H      /* RF PMM mapping register */
#define RFPMM9                 RFPMMIV_H      /* RF PMM mapping register */

#define PMMPW                  (0xA500)       /* PMM Register Write Password */
#define PMMPW_H                (0xA5)         /* PMM Register Write Password for high word access */

/* RFPMMCTL0 Control Bits */
#define RFPMMSWBOR             (0x0004)       /* RF MM Software brownout reset. BOR. Bit: 2 */
#define RFPMMSWPOR             (0x0008)       /* RF PMM Software power-on reset. POR. Bit: 3 */
#define RFPMM_EN_VF_REG        (0x0010)       /* RF PMM Enable voltage regulator for FRAM vddf permanently */
#define RFPMM_EN_BATSWITCH     (0x0020)       /* RF PMM Enable the battery switch */
#define RFPMM_EN_V_DOUB        (0x0040)       /* RF PMM Enable voltage regulator for digital core. VDD */

/* RFPMMCTL0 Control Bits */
#define RFPMMSWBOR_L           (0x0004)       /* RF MM Software brownout reset. BOR. Bit: 2 */
#define RFPMMSWPOR_L           (0x0008)       /* RF PMM Software power-on reset. POR. Bit: 3 */
#define RFPMM_EN_VF_REG_L      (0x0010)       /* RF PMM Enable voltage regulator for FRAM vddf permanently */
#define RFPMM_EN_BATSWITCH_L   (0x0020)       /* RF PMM Enable the battery switch */
#define RFPMM_EN_V_DOUB_L      (0x0040)       /* RF PMM Enable voltage regulator for digital core. VDD */

#define RFPMM_EN_BATSWITCH_BYTE (0x20)         /* RF PMM Enable the battery switch */
#define RFPMM_EN_V_DOUB_BYTE   (0x40)         /* RF PMM Enable voltage regulator for digital core. VDD */

/* RFPMMCTL1 Control Bits */
#define RFPMM_NRESET_VF        (0x0001)       /* RF PMM Low active reset signal of VDDF Bit: 0 */
#define RFPMM_NRESET_VB        (0x0002)       /* RF PMM Low active reset signal of VDDB Bit: 1 */
#define RFPMM_NRESET_VR        (0x0004)       /* RF PMM Low active reset signal of VDDR Bit: 2 */
#define RFPMM_NRESET_VH        (0x0008)       /* RF PMM Low active reset signal of VDDH Bit: 3 */
#define RFPMM_NRESET_V2X       (0x0010)       /* RF PMM Low active reset signal of VDD2X Bit: 4 */
#define RFPMM_BW_VR_VBN        (0x0100)       /* RF PMM indicates position of the bulk switch Bit: 8 */

/* RFPMMCTL1 Control Bits */
#define RFPMM_NRESET_VF_L      (0x0001)       /* RF PMM Low active reset signal of VDDF Bit: 0 */
#define RFPMM_NRESET_VB_L      (0x0002)       /* RF PMM Low active reset signal of VDDB Bit: 1 */
#define RFPMM_NRESET_VR_L      (0x0004)       /* RF PMM Low active reset signal of VDDR Bit: 2 */
#define RFPMM_NRESET_VH_L      (0x0008)       /* RF PMM Low active reset signal of VDDH Bit: 3 */
#define RFPMM_NRESET_V2X_L     (0x0010)       /* RF PMM Low active reset signal of VDD2X Bit: 4 */

/* RFPMMCTL1 Control Bits */
#define RFPMM_BW_VR_VBN_H      (0x0001)       /* RF PMM indicates position of the bulk switch Bit: 8 */

/* RFMMIE Control Bits */
#define RFPMMIEVF              (0x0001)       /* RF PMM Interrupt enable voltage regulator VDDF Bit: 0 */
#define RFPMMIEVB              (0x0002)       /* RF PMM Interrupt enable voltage regulator VDDB Bit: 1 */
#define RFPMMIEVR              (0x0004)       /* RF PMM Interrupt enable voltage regulator VDDR Bit: 2 */
#define RFPMMIEVH              (0x0008)       /* RF PMM Interrupt enable voltage regulator VDDH Bit: 3 */
#define RFPMMIEV2X             (0x0010)       /* RF PMM Interrupt enable voltage regulator VDD2X Bit: 4 */

/* RFMMIE Control Bits */
#define RFPMMIEVF_L            (0x0001)       /* RF PMM Interrupt enable voltage regulator VDDF Bit: 0 */
#define RFPMMIEVB_L            (0x0002)       /* RF PMM Interrupt enable voltage regulator VDDB Bit: 1 */
#define RFPMMIEVR_L            (0x0004)       /* RF PMM Interrupt enable voltage regulator VDDR Bit: 2 */
#define RFPMMIEVH_L            (0x0008)       /* RF PMM Interrupt enable voltage regulator VDDH Bit: 3 */
#define RFPMMIEV2X_L           (0x0010)       /* RF PMM Interrupt enable voltage regulator VDD2X Bit: 4 */

/* RFPMMIFG Control Bits */
#define RFPMMIFGVF             (0x0001)       /* RF PMM Interrupt flag voltage regulator VDDF Bit: 0 */
#define RFPMMIFGVB             (0x0002)       /* RF PMM Interrupt flag voltage regulator VDDB Bit: 1 */
#define RFPMMIFGVR             (0x0004)       /* RF PMM Interrupt flag voltage regulator VDDR Bit: 2 */
#define RFPMMIFGVH             (0x0008)       /* RF PMM Interrupt flag voltage regulator VDDH Bit: 3 */
#define RFPMMIFGV2X            (0x0010)       /* RF PMM Interrupt flag voltage regulator VDD2X Bit: 4 */

/* RFPMMIFG Control Bits */
#define RFPMMIFGVF_L           (0x0001)       /* RF PMM Interrupt flag voltage regulator VDDF Bit: 0 */
#define RFPMMIFGVB_L           (0x0002)       /* RF PMM Interrupt flag voltage regulator VDDB Bit: 1 */
#define RFPMMIFGVR_L           (0x0004)       /* RF PMM Interrupt flag voltage regulator VDDR Bit: 2 */
#define RFPMMIFGVH_L           (0x0008)       /* RF PMM Interrupt flag voltage regulator VDDH Bit: 3 */
#define RFPMMIFGV2X_L          (0x0010)       /* RF PMM Interrupt flag voltage regulator VDD2X Bit: 4 */

